# Определите длину самой длинной последовательности, состоящей из символов X.
# Хотя бы один символ X находится в последовательности.
# f = open('24_demo (1).txt')

# s = f.read()
# s = s.replace('Y', ' ')
# s = s.replace('Z', ' ')
# a = s.split()
# print(len(max(a)))

print(len(max(open('24_demo (1).txt').read().replace('Y', ' ').replace('Z', ' ').split())))


x
xx
xxx
if 'xxxx' in s:
